models/ContribMetadata.dot
digraph G {
  graph [splines="ortho" pad=0.5 ranksep="1.2.equally" nodesep="1.2.equally"]
  edge [color="gray50"]
  node [shape="box" fontname="Helvetica-bold"]

  ContributionElementMetadata [
    shape="plain"
    fontname="Helvetica"
    label=<<TABLE BORDER="0" CELLBORDER="1" CELLSPACING="0" CELLPADDING="10">
    <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
    <TR><TD ALIGN="CENTER"><B>ContributionElementMetadata</B></TD></TR>
  </TABLE>
  </TD>
  </TR>
  
  <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
              <TR><TD ALIGN="LEFT">+dateTime : Iso8601DateTime</TD></TR>
            <TR><TD ALIGN="LEFT">+contributor : «Bibliography»Contributor&#91;0..1&#93;</TD></TR>
            <TR><TD ALIGN="LEFT">+integrityValue : integrityValue&#91;0..*&#93;</TD></TR>
  </TABLE>
        </TD>
  </TR>
  
  <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
    <TR><TD ALIGN="LEFT"></TD></TR>
  </TABLE></TD>
  </TR>
  
  </TABLE>>]
  
  IntregityValue [
    shape="plain"
    fontname="Helvetica"
    label=<<TABLE BORDER="0" CELLBORDER="1" CELLSPACING="0" CELLPADDING="10">
    <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
    <TR><TD ALIGN="CENTER"><B>IntregityValue</B></TD></TR>
  </TABLE>
  </TD>
  </TR>
  
  <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
    <TR><TD ALIGN="LEFT"></TD></TR>
  </TABLE></TD>
  </TR>
  
  <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
    <TR><TD ALIGN="LEFT"></TD></TR>
  </TABLE></TD>
  </TR>
  
  </TABLE>>]
  
  Hash [
    shape="plain"
    fontname="Helvetica"
    label=<<TABLE BORDER="0" CELLBORDER="1" CELLSPACING="0" CELLPADDING="10">
    <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
    <TR><TD ALIGN="CENTER"><B>Hash</B></TD></TR>
  </TABLE>
  </TD>
  </TR>
  
  <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
              <TR><TD ALIGN="LEFT">+algorithm : Iso10118Oid</TD></TR>
            <TR><TD ALIGN="LEFT">+value : String</TD></TR>
  </TABLE>
        </TD>
  </TR>
  
  <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
    <TR><TD ALIGN="LEFT"></TD></TR>
  </TABLE></TD>
  </TR>
  
  </TABLE>>]
  
  Signature [
    shape="plain"
    fontname="Helvetica"
    label=<<TABLE BORDER="0" CELLBORDER="1" CELLSPACING="0" CELLPADDING="10">
    <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
    <TR><TD ALIGN="CENTER"><B>Signature</B></TD></TR>
  </TABLE>
  </TD>
  </TR>
  
  <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
              <TR><TD ALIGN="LEFT">+algorithm : Iso14888Oid</TD></TR>
            <TR><TD ALIGN="LEFT">+publicKey : String</TD></TR>
            <TR><TD ALIGN="LEFT">+signature : String</TD></TR>
  </TABLE>
        </TD>
  </TR>
  
  <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
    <TR><TD ALIGN="LEFT"></TD></TR>
  </TABLE></TD>
  </TR>
  
  </TABLE>>]
  
  Iso10118Oid [
    shape="plain"
    fontname="Helvetica"
    label=<<TABLE BORDER="0" CELLBORDER="1" CELLSPACING="0" CELLPADDING="10">
    <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
    <TR><TD ALIGN="CENTER">«dataType»</TD></TR>\n<TR><TD ALIGN="CENTER"><B>Iso10118Oid</B></TD></TR>
  </TABLE>
  </TD>
  </TR>
  
  <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
    <TR><TD ALIGN="LEFT"></TD></TR>
  </TABLE></TD>
  </TR>
  
  <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
    <TR><TD ALIGN="LEFT"></TD></TR>
  </TABLE></TD>
  </TR>
  
  </TABLE>>]
  
  Iso14888Oid [
    shape="plain"
    fontname="Helvetica"
    label=<<TABLE BORDER="0" CELLBORDER="1" CELLSPACING="0" CELLPADDING="10">
    <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
    <TR><TD ALIGN="CENTER">«dataType»</TD></TR>\n<TR><TD ALIGN="CENTER"><B>Iso14888Oid</B></TD></TR>
  </TABLE>
  </TD>
  </TR>
  
  <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
    <TR><TD ALIGN="LEFT"></TD></TR>
  </TABLE></TD>
  </TR>
  
  <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
    <TR><TD ALIGN="LEFT"></TD></TR>
  </TABLE></TD>
  </TR>
  
  </TABLE>>]

  IntregityValue -> ContributionElementMetadata [dir="direct" arrowtail="onormal" arrowhead="vee"]
  IntregityValue -> Hash [dir="back" arrowtail="onormal" arrowhead="onormal"]
  IntregityValue -> Signature [dir="back" arrowtail="onormal" arrowhead="onormal"]
}
